In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('./Data/loan.csv')
df.head()

C:\Users\GSCHOI\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3020: DtypeWarning: Columns (19,55) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

,id,member_id,loan_amnt,funded_amnt,funded_amnt_inv,term,int_rate,installment,grade,sub_grade,...,total_bal_il,il_util,open_rv_12m,open_rv_24m,max_bal_bc,all_util,total_rev_hi_lim,inq_fi,total_cu_tl,inq_last_12m
0,1077501,1296599,5000.0,5000.0,4975.0,36 months,10.65,162.87,B,B2,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1077430,1314167,2500.0,2500.0,2500.0,60 months,15.27,59.83,C,C4,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,1077175,1313524,2400.0,2400.0,2400.0,36 months,15.96,84.33,C,C5,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,1076863,1277178,10000.0,10000.0,10000.0,36 months,13.49,339.31,C,C1,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,1075358,1311748,3000.0,3000.0,3000.0,60 months,12.69,67.79,B,B5,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [3]:
df.shape

(887379, 74)

In [4]:
# 열의 내용 확인하기
df.columns

Index(['id', 'member_id', 'loan_amnt', 'funded_amnt', 'funded_amnt_inv',
       'term', 'int_rate', 'installment', 'grade', 'sub_grade', 'emp_title',
       'emp_length', 'home_ownership', 'annual_inc', 'verification_status',
       'issue_d', 'loan_status', 'pymnt_plan', 'url', 'desc', 'purpose',
       'title', 'zip_code', 'addr_state', 'dti', 'delinq_2yrs',
       'earliest_cr_line', 'inq_last_6mths', 'mths_since_last_delinq',
       'mths_since_last_record', 'open_acc', 'pub_rec', 'revol_bal',
       'revol_util', 'total_acc', 'initial_list_status', 'out_prncp',
       'out_prncp_inv', 'total_pymnt', 'total_pymnt_inv', 'total_rec_prncp',
       'total_rec_int', 'total_rec_late_fee', 'recoveries',
       'collection_recovery_fee', 'last_pymnt_d', 'last_pymnt_amnt',
       'next_pymnt_d', 'last_credit_pull_d', 'collections_12_mths_ex_med',
       'mths_since_last_major_derog', 'policy_code', 'application_type',
       'annual_inc_joint', 'dti_joint', 'verification_status_joint',
       'acc_now_delinq', 'tot_coll_amt', 'tot_cur_bal', 'open_acc_6m',
       'open_il_6m', 'open_il_12m', 'open_il_24m', 'mths_since_rcnt_il',
       'total_bal_il', 'il_util', 'open_rv_12m', 'open_rv_24m', 'max_bal_bc',
       'all_util', 'total_rev_hi_lim', 'inq_fi', 'total_cu_tl',
       'inq_last_12m'],
      dtype='object')

In [5]:
# 필요한 부분만 발췌하여 새로운 data frame 생성
df2 = df[['loan_amnt','loan_status','grade','int_rate','term']]

In [6]:
df2.head()

   loan_amnt  loan_status grade  int_rate        term
0     5000.0   Fully Paid     B     10.65   36 months
1     2500.0  Charged Off     C     15.27   60 months
2     2400.0   Fully Paid     C     15.96   36 months
3    10000.0   Fully Paid     C     13.49   36 months
4     3000.0      Current     B     12.69   60 months

In [7]:
df2.tail()

        loan_amnt loan_status grade  int_rate        term
887374    10000.0     Current     B     11.99   36 months
887375    24000.0     Current     B     11.99   36 months
887376    13000.0     Current     D     15.99   60 months
887377    12000.0     Current     E     19.99   60 months
887378    20000.0     Current     B     11.99   36 months

In [8]:
# data 분류 분석하기
# loan_status의 분류 종류 알아보기
df2['loan_status'].unique()

array(['Fully Paid', 'Charged Off', 'Current', 'Default',
       'Late (31-120 days)', 'In Grace Period', 'Late (16-30 days)',
       'Does not meet the credit policy. Status:Fully Paid',
       'Does not meet the credit policy. Status:Charged Off', 'Issued'],
      dtype=object)

In [9]:
# grade의 종류 알아보기
df2['grade'].unique()

array(['B', 'C', 'A', 'E', 'F', 'D', 'G'], dtype=object)

In [10]:
# term의 종류
df2['term'].unique()

array([' 36 months', ' 60 months'], dtype=object)

In [11]:
# nan값 제거
df2.shape

(887379, 5)

In [12]:
df2 = df2.dropna(how = 'any')# any 하나라도있으면 제거 all은 전부다 있어야만 제거

In [13]:
df2.shape

(887379, 5)

In [14]:
# Lending Club에서는 36개월과 60개월의 2가지 상품이있다. 각각의 상품을 통해 이루어진 전체 대출 금액
term_to_loan_amnt_dict = {}
unique_terms = df2['term'].unique() #term의 종류 구하기
for term in unique_terms:
    loan_amnt_sum = df2.loc[df2['term']==term, 'loan_amnt'].sum() # 해당 term의 합계 (선생님이한것)
    term_to_loan_amnt_dict[term]= loan_amnt_sum # dictionary에 넣기

term_to_loan_amnt_dict

{' 36 months': 7752507375.0, ' 60 months': 5341004575.0}

In [15]:
unique_terms = df2['term'].unique()

In [16]:
# aaa = df2[df2['term']==unique_terms[1]]
df2[df2['term']==unique_terms[1]].loc[:,'loan_amnt'].sum()

5341004575.0

In [19]:
df2.head()

   loan_amnt  loan_status grade  int_rate        term
0     5000.0   Fully Paid     B     10.65   36 months
1     2500.0  Charged Off     C     15.27   60 months
2     2400.0   Fully Paid     C     15.96   36 months
3    10000.0   Fully Paid     C     13.49   36 months
4     3000.0      Current     B     12.69   60 months

In [22]:
# 대출자의 대출상태에 따른 대출 등급
total_status_category = df2['loan_status'].unique()

In [23]:
df2['loan_status'].unique()

array(['Fully Paid', 'Charged Off', 'Current', 'Default',
       'Late (31-120 days)', 'In Grace Period', 'Late (16-30 days)',
       'Does not meet the credit policy. Status:Fully Paid',
       'Does not meet the credit policy. Status:Charged Off', 'Issued'],
      dtype=object)

In [24]:
# Bad Status - 134568 정해진 정보 
bad_status_category = total_status_category[[1,3,4,5,6,8]]

In [26]:
bad_status_category # In grace period : 거치기간

array(['Charged Off', 'Default', 'Late (31-120 days)', 'In Grace Period',
       'Late (16-30 days)',
       'Does not meet the credit policy. Status:Charged Off'],
      dtype=object)

In [29]:
# bad loan status column 추가
df2['bad_loan_status'] = df2['loan_status'].isin(bad_status_category)
df2.head()

,loan_amnt,loan_status,grade,int_rate,term,lad_loan_status,bad_loan_status
0,5000.0,Fully Paid,B,10.65,36 months,False,False
1,2500.0,Charged Off,C,15.27,60 months,True,True
2,2400.0,Fully Paid,C,15.96,36 months,False,False
3,10000.0,Fully Paid,C,13.49,36 months,False,False
4,3000.0,Current,B,12.69,60 months,False,False

In [31]:
# bad loan status에 따른 등급 확인
bad_loan_status_to_grade = df2.loc[df2['bad_loan_status']==True,'grade'].value_counts()

In [32]:
bad_loan_status_to_grade.sort_index()

A     3663
B    13456
C    19054
D    15859
E     9745
F     4383
G     1269
Name: grade, dtype: int64

In [36]:
# good loan status에 따른 등급 확인
good_loan_status_to_grade = df2.loc[df2['bad_loan_status']==False,'grade'].value_counts()
good_loan_status_to_grade.sort_index()

A    144539
B    241079
C    226806
D    123683
E     60960
F     18663
G      4220
Name: grade, dtype: int64

In [38]:
df2.head()

,loan_amnt,loan_status,grade,int_rate,term,lad_loan_status,bad_loan_status
0,5000.0,Fully Paid,B,10.65,36 months,False,False
1,2500.0,Charged Off,C,15.27,60 months,True,True
2,2400.0,Fully Paid,C,15.96,36 months,False,False
3,10000.0,Fully Paid,C,13.49,36 months,False,False
4,3000.0,Current,B,12.69,60 months,False,False

In [42]:
# 대출자가 대출한 총액과 이자간의 상관관계
df['loan_amnt'].corr(df['int_rate'])

0.1450230992988384

In [43]:
# bad_loan_status_to_grade 저장
bad_loan_status_to_grade.to_csv('./data/bad_loan_status_to_grade.csv',sep=',')